# HeatTransferCoefficient Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalProperties..::..HeatTransferCoefficient Property
ThermalProperties Class See Also
---
The heat transfer coefficient value (U-Value). The unit is watts per meter-squared kelvin (W/(m^2*K)).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double HeatTransferCoefficient { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HeatTransferCoefficient As Double
	Get
```

Visual C++
---
```text
public:
property double HeatTransferCoefficient {
	double get ();
}
```

# See Also
ThermalProperties Class
Autodesk.Revit.DB Namespace